Repository: let-me-isekai-u/Belugas-Express-Mobile-App
Catalog: lib/l10n/app_*.arb
Languages: vi

# phone
source: Phone number
vi: Số điện thoại

source: Password
vi: Mật khẩu

source: Login
vi: Đăng nhập

source: Forgot password
vi: Quên mật khẩu

source: Register
vi: Đăng ký

# loginErrorEmpty
source: Please enter both Phone number and Password
vi: Vui lòng nhập đầy đủ Số điện thoại và Mật khẩu

# loginSuccess
source: Login successful
vi: Đăng nhập thành công

# loginErrorWrong
source: Wrong phone number or password
vi: Sai số điện thoại hoặc Mật khẩu

# loginErrorLocked
source: Account is locked, cannot login
vi: Tài khoản đã bị khóa, không thể đăng nhập

# loginErrorOther
source: An error occurred, please try again
vi: Có lỗi xảy ra, vui lòng thử lại

# nameHint
source: Name
vi: Tên

# passwordHint
source: Password
vi: Mật khẩu

# confirmPasswordHint
source: Confirm password
vi: Xác nhận mật khẩu

# phoneHint
source: Phone number
vi: Số điện thoại

# verificationCodeHint
source: Verification code
vi: Mã xác nhận

source: Send code
vi: Nhận mã

# resendCode
source: Resend ({count})
vi: Gửi lại ({count})

# referralCodeHint
source: Referral code
vi: Mã giới thiệu

# zaloHint
source: Zalo number (optional)
vi: Số Zalo (tùy chọn)

# agreeTerms
source: I agree to
vi: Tôi đồng ý với

source: Terms of use
vi: Điều khoản sử dụng

# registerButton
source: Register
vi: Đăng ký

# alreadyAccount
source: Already have an account? Login
vi: Đã có tài khoản? Đăng nhập

# enterName
source: Please enter your name
vi: Vui lòng nhập tên

# enterEmail
source: Please enter your email
vi: Vui lòng nhập email

source: Invalid email
vi: Email không hợp lệ

# enterPassword
source: Please enter password
vi: Vui lòng nhập mật khẩu

# passwordMismatch
source: Passwords do not match
vi: Mật khẩu không khớp

# enterPhone
source: Please enter phone number
vi: Vui lòng nhập số điện thoại

# invalidPhone
source: Invalid phone number
vi: Số điện thoại không hợp lệ

# enterVerificationCode
source: Enter the verification code to confirm deletion of this user account
vi: Nhập mã xác thực để xác nhận xoá tài khoản người dùng này

# agreeTermsWarning
source: You must agree to the terms of use
vi: Bạn cần đồng ý với điều khoản sử dụng

# sendCodeSuccess
source: Verification code sent to email!
vi: Đã gửi mã xác nhận về email!

# sendCodeError
source: Failed to send code!
vi: Gửi mã thất bại!

# sendCodeError500
source: Error sending email, please try again
vi: Lỗi khi gửi email, vui lòng thử lại

# connectionError
source: Connection error: {error}
vi: Lỗi kết nối: {error}

# forgotPasswordTitle
source: Forgot Password
vi: Quên mật khẩu

# enterEmailHint
source: Enter your email
vi: Nhập email của bạn

# enterCodeLabel
source: Verification code
vi: Mã xác nhận

# enterCodeHint
source: Enter the verification code sent to your email
vi: Nhập mã xác nhận đã gửi đến email

# sendVerificationCodeButton
source: Send code
vi: Nhận mã

# resendVerificationCodeButton
source: Resend ({seconds}s)
vi: Gửi lại ({seconds}s)

# verifyCodeButton
source: Verify
vi: Xác nhận

source: Back to login
vi: Quay lại đăng nhập

# emailEmptyError
source: Please enter your email
vi: Vui lòng nhập email

# codeEmptyError
source: Please enter verification code
vi: Vui lòng nhập mã xác nhận

# sendCodeSuccessMessage
source: Verification code has been sent to your email!
vi: Mã xác nhận đã được gửi về email!

# sendCodeFailedMessage
source: Cannot send verification code!
vi: Không thể gửi mã xác nhận!

# codeInvalidMessage
source: Verification code is invalid!
vi: Mã xác nhận không hợp lệ!

# verificationSuccessMessage
source: Verification successful!
vi: Xác minh thành công!

# defaultUserName
source: User
vi: Người dùng

# homeTabHome
source: Home
vi: Trang chủ

# homeTabRecharge
source: Recharge
vi: Nạp tiền

# homeTabCreateOrder
source: Create Order
vi: Tạo đơn

# homeTabOrders
source: Orders
vi: Đơn hàng

# homeTabTrade
source: Trade
vi: Giao dịch

# homeTabProfile
source: Profile
vi: Tài khoản

# welcomeTitle
source: Welcome to
vi: Chào mừng bạn đến với

# welcomeMessage
source: Welcome to the Beluga Express international delivery app.
vi: Chào mừng bạn đã đến với ứng dụng giao nhận quốc tế Beluga Express.

# walletLabel
source: Wallet: {amount} VND
vi: Ví: {amount} VND

# profileTitle
source: Profile
vi: Trang cá nhân

# profileName
source: Full name
vi: Họ tên

# profilePhone
source: Phone number
vi: Số điện thoại

# changePasswordButton
source: Change password
vi: Đổi mật khẩu

# logoutButton
source: Logout
vi: Đăng xuất

# changeLanguage
source: Change the language
vi: Thay đổi ngôn ngữ

# rechargeTitle
source: Recharge Wallet
vi: Nạp tiền vào ví

# rechargeAmountHint
source: Enter amount to recharge
vi: Nhập số tiền nạp

# rechargeMinAmountError
source: Minimum recharge amount is 50,000 VND
vi: Số tiền nạp tối thiểu là 50.000 VND

# rechargeUserIdError
source: Cannot get user ID.
vi: Không lấy được ID người dùng.

# rechargeQRCodeTitle
source: Scan QR to pay
vi: Quét mã QR để thanh toán

# rechargeQRCodeAmount
source: Amount: {amount} VND
vi: Số tiền: {amount} VND

# rechargeQRCodeContent
source: Content: {content}
vi: Nội dung: {content}

# rechargeQRCodeCountdown
source: Time left: {minutes}:{seconds}
vi: Thời gian còn lại: {minutes}:{seconds}

# rechargeQRCodeCloseButton
source: Close QR
vi: Đóng mã QR

# rechargeSuccess
source: Recharge successful!
vi: ✅ Nạp tiền thành công!

# rechargeTimeout
source: ⛔ Payment time expired!
vi: ⛔ Hết thời gian thanh toán!

# tradeTitle
source: Transaction History
vi: Lịch sử giao dịch

# tradeNoTransactions
source: No transactions yet
vi: Chưa có giao dịch nào

# tradeAmountLabel
source: Amount
vi: Số tiền

# tradePaymentForLabel
source: Payment for
vi: Thanh toán cho

# tradePaymentDateLabel
source: Payment date
vi: Ngày thanh toán

# orderTitle
source: Order List
vi: Danh sách đơn hàng

# orderNoOrders
source: No orders available
vi: Không có đơn hàng.

# orderStatusAll
source: All
vi: Tất cả

# orderStatusPickup
source: Waiting for pickup
vi: Đang đến lấy hàng

# orderStatusInTransitToHub
source: En route to hub
vi: Đang trên đường đến kho trung chuyển

# orderStatusAtHub
source: Arrived at hub
vi: Đã đến kho

# orderStatusAwaitingPayment
source: Awaiting payment
vi: Chờ thanh toán

# orderStatusAwaitingShipment
source: Waiting to ship
vi: Chờ gửi hàng

# orderStatusShipping
source: Shipping
vi: Đang vận chuyển

# orderStatusDelivered
source: Delivered
vi: Giao hàng thành công

# orderStatusCancelled
source: Cancelled
vi: Đã hủy

# orderCodeLabel
source: Order code: {code}
vi: Mã đơn: {code}

# orderSenderLabel
source: Sender: {name} ({phone})
vi: Người gửi: {name} ({phone})

# orderReceiverLabel
source: Receiver: {name}
vi: Người nhận: {name}

# orderAddressLabel
source: Address: {address}
vi: Địa chỉ: {address}

# orderTotalLabel
source: Total: {amount}
vi: Tổng: {amount}

# orderDownPaymentLabel
source: Deposit: {amount}
vi: Đặt cọc: {amount}

# orderPaymentButton
source: Pay {amount}
vi: Thanh toán {amount}

# orderDialogTitle
source: Order
vi: Đơn hàng

# orderInsufficientWallet
source: Wallet balance is not enough. Please recharge.
vi: Số dư ví không đủ. Vui lòng nạp thêm.

# orderExpiredSession
source: Session expired. Please login again.
vi: Phiên đăng nhập hết hạn. Vui lòng đăng nhập lại.

# orderPaymentSuccess
source: Payment successful
vi: Thanh toán thành công

# orderQrTitle
source: Scan QR to pay
vi: Quét mã QR để thanh toán

# orderQrAmount
source: Amount: {amount}
vi: Số tiền: {amount}

# orderQrContent
source: Content: {content}
vi: Nội dung: {content}

# orderQrCloseButton
source: Close QR
vi: Đóng mã QR

# orderStatusDetailButton
source: Status details
vi: Chi tiết trạng thái

# createOrderTitle
source: Create Order
vi: Tạo đơn hàng

# createOrderSenderSection
source: Sender Information
vi: Thông tin người gửi

# createOrderReceiverSection
source: Receiver Information
vi: Thông tin người nhận

# createOrderItemsSection
source: Order Items
vi: Thông tin mặt hàng

# createOrderSenderPhone
source: Sender Phone
vi: Số điện thoại người gửi

# createOrderSenderName
source: Sender Name
vi: Họ tên người gửi

# createOrderSenderAddress
source: Pickup Address
vi: Địa chỉ lấy hàng

# createOrderReceiverPhone
source: Receiver Phone
vi: Số điện thoại người nhận

# createOrderReceiverName
source: Receiver Name
vi: Họ tên người nhận

# createOrderReceiverAddress
source: Receiver Address
vi: Địa chỉ người nhận

# createOrderReceiverCountry
source: Destination Country
vi: Quốc gia nhận

# createOrderItemType
source: Item Type
vi: Loại hàng

# createOrderItemWeight
source: Unit ({unit})
vi: Đơn vị ({unit})

# createOrderItemRemove
source: Remove item
vi: Xoá mặt hàng

# createOrderAddItem
source: Add Item
vi: Thêm mặt hàng

# createOrderConfirmButton
source: Confirm Order
vi: Xác nhận đơn hàng

# createOrderErrorEmptyField
source: Please check all required fields!
vi: Vui lòng kiểm tra lại thông tin!

# createOrderErrorCountry
source: Please select a country!
vi: Vui lòng chọn quốc gia!

# createOrderErrorInvalidWeight
source: Please enter valid quantity for each item!
vi: Vui lòng nhập số lượng hợp lệ cho mỗi mặt hàng!

# createOrderErrorNoItems
source: Order must have at least one item!
vi: Đơn hàng phải có ít nhất một mặt hàng!

# createOrderErrorWalletFetch
source: Error fetching wallet balance: {code}
vi: Lỗi khi lấy số dư ví: {code}

# confirmOrderTitle
source: Confirm Order
vi: Xác nhận đơn hàng

# confirmOrderSenderSection
source: Sender Information
vi: Thông tin người gửi

# confirmOrderReceiverSection
source: Receiver Information
vi: Thông tin người nhận

# confirmOrderItemsSection
source: Order Items
vi: Chi tiết hàng hoá

# confirmOrderWalletBalance
source: Current wallet balance: {balance} VND
vi: Số dư ví hiện tại: {balance} VND

# confirmOrderDepositButton
source: Confirm deposit 500,000 VND
vi: Xác nhận đặt cọc 500.000 VND

# confirmOrderDialogTitle
source: Notification
vi: Thông báo

# confirmOrderDialogFetchError
source: Cannot fetch wallet balance.
vi: Không thể lấy số dư ví.

# confirmOrderDialogInsufficientWallet
source: Insufficient wallet balance to create order. Please top up.
vi: Số dư ví không đủ để tạo đơn hàng. Vui lòng nạp thêm.

# confirmOrderDialogCreateSuccess
source: Order created successfully! Code: {code}
vi: Tạo đơn hàng thành công! Mã đơn: {code}

# confirmOrderDialogCreateFailed
source: Order creation failed!
vi: Tạo đơn thất bại!

# confirmOrderDialogSessionExpired
source: Session expired. Please login again.
vi: Phiên đăng nhập hết hạn. Vui lòng đăng nhập lại.

# confirmOrderDialogUnknownError
source: Unknown error. Code: {code}
vi: Lỗi không xác định. Mã lỗi: {code}

# changePasswordTitle
source: Change Password
vi: Đổi mật khẩu

# changePasswordNew
source: New Password
vi: Mật khẩu mới

# changePasswordConfirm
source: Confirm Password
vi: Xác nhận mật khẩu

# againConfirmPasswordButton
source: Confirm
vi: Xác nhận

# changePasswordBackLogin
source: Back to Login
vi: Quay về đăng nhập

# changePasswordErrorEmpty
source: Please enter a new password
vi: Vui lòng nhập mật khẩu mới

# changePasswordErrorWeak
source: Password must be ≥8 chars, include upper, lower, number, special
vi: Mật khẩu phải ≥8 ký tự, gồm chữ hoa, chữ thường, số và ký tự đặc biệt

# changePasswordErrorConfirmEmpty
source: Please confirm password
vi: Vui lòng nhập lại mật khẩu

# changePasswordErrorNotMatch
source: Password confirmation does not match
vi: Mật khẩu xác nhận không khớp

# changePasswordSuccess
source: Password changed successfully!
vi: Đổi mật khẩu thành công!

# changePasswordEmailNotRegistered
source: This email is not registered!
vi: Tài khoản email này chưa được đăng ký!

# changePasswordFailed
source: Password change failed!
vi: Đổi mật khẩu thất bại!

# changePasswordConnectionError
source: Connection error: {error}
vi: Lỗi kết nối: {error}

# orderStatusScreenTitle
source: Order List
vi: Danh sách đơn hàng

# orderStatusTabAll
source: All
vi: Tất cả

# orderStatusTabPickup
source: Waiting for pickup
vi: Đang đến lấy hàng

# orderStatusTabInTransit
source: En route to hub
vi: Đang trên đường đến kho

# orderStatusTabAtHub
source: Arrived at hub
vi: Đã đến kho

# orderStatusTabAwaitingPayment
source: Awaiting payment
vi: Chờ thanh toán

# orderStatusTabAwaitingShipment
source: Waiting to ship
vi: Chờ gửi hàng

# orderStatusTabShipping
source: Shipping
vi: Đang vận chuyển

# orderStatusTabDelivered
source: Delivered
vi: Giao hàng thành công

# orderStatusTabCancelled
source: Cancelled
vi: Đã hủy

# orderStatusLabel
source: Status: {status}
vi: Trạng thái: {status}

# orderPhoneLabel
source: Phone: {phone}
vi: SĐT: {phone}

# orderBalancePaymentLabel
source: Remaining payment: {amount}
vi: Thanh toán số dư: {amount}

# orderCreatedDateLabel
source: Created on: {date}
vi: Ngày tạo: {date}

# orderItemListLabel
source: Item list:
vi: Danh sách hàng hóa:

# orderUpdatedDetailsLabel
source: Updated details
vi: Chi tiết sau cập nhật

# orderUpdatedNotice
source: Note: This content has been edited in the 'Update Order' screen (not sent if the green action button was not pressed).
vi: Lưu ý: Đây là nội dung đã chỉnh trong màn hình 'Cập nhật đơn hàng' (chưa gửi nếu chưa bấm nút hành động màu xanh).

# orderActionChangeStatus
source: Change status
vi: Đổi trạng thái

# orderActionUpdateOrder
source: Update order
vi: Cập nhật đơn hàng

# orderSnackUpdateSuccess
source: Order updated successfully
vi: Cập nhật đơn hàng thành công

# orderSnackUpdateFailed
source: Failed to update order
vi: Cập nhật đơn hàng thất bại

# orderSnackSessionExpired
source: Session expired. Please login again
vi: Phiên đăng nhập hết hạn

# contractorHomeWelcomeTitle
source: Welcome to Beluga Express!
vi: Chào mừng đến với Beluga Express!

# contractorHomeWelcomeMessage
source: Select and update available order statuses.
vi: Lựa chọn và cập nhật trạng thái đơn hàng khả dụng.

# contractorHomeViewOrdersButton
source: View Available Orders
vi: Xem đơn khả dụng

# contractorHomeTabHome
source: Home
vi: Trang chủ

# contractorHomeTabOrders
source: Orders
vi: Đơn hàng

# contractorHomeTabProfile
source: Profile
vi: Tài khoản

# updateOrderAppBarTitle
source: Update Order
vi: Cập nhật đơn hàng

# updateOrderItemTypeLabel
source: Item Type
vi: Loại hàng

# updateOrderDeleteItemTooltip
source: Delete item
vi: Xoá mặt hàng

# updateOrderAddItemButton
source: Add Item
vi: Thêm mặt hàng

# updateOrderConfirmDialogTitle
source: Confirm Order Update
vi: Xác nhận cập nhật đơn hàng

# updateOrderConfirmDialogChangesLabel
source: Changes:
vi: Chi tiết thay đổi:

# updateOrderConfirmButton
source: Confirm
vi: Cập nhật

# updateOrderCancelButton
source: Cancel
vi: Huỷ

# updateOrderInvalidQuantityMessage
source: Please enter a valid quantity for each item
vi: Vui lòng nhập số lượng hợp lệ cho mỗi mặt hàng

# updateOrderLoadingPricingMessage
source: Loading pricing table...
vi: Đang tải bảng giá...

# updateOrderPricingErrorMessage
source: Error fetching pricing table: {error}
vi: Lỗi khi lấy bảng giá: {error}

# updateOrderPricingLoadedMessage
source: {count} items loaded in pricing table
vi: Đã tải {count} mục trong bảng giá

# updateOrderNoItemsMessage
source: No items. Press Add to include.
vi: Chưa có hàng hóa. Nhấn Thêm để thêm.

source: Cancel
vi: Huỷ

source: Confirm
vi: Xác nhận

source: Update
vi: Cập nhật

# createOrderButton
source: Create Delivery Order
vi: Tạo đơn vận chuyển

# profileContactUs
source: Contact us
vi: Liên hệ với chúng tôi

# deleteAccountButton
source: Delete account
vi: xoá tài khoản

# verificationCode
source: OTP code
vi: Mã OTP
